#ifndef SF64_RECOMP_ASSETS
#define SF64_RECOMP_ASSETS

#include "patches.h"
#include "fox_map.h"

typedef struct UnkStruct_D_i4_801A03E0 {
    f32 unk_00;
    f32 unk_04;
    f32 unk_08;
    f32 unk_0C;
    f32 unk_10;
    f32 unk_14;
    s32 unk_18;
} UnkStruct_D_i4_801A03E0;

typedef enum TitleTeam {
    /* 0 */ TEAM_FOX,
    /* 1 */ TEAM_FALCO,
    /* 2 */ TEAM_PEPPY,
    /* 3 */ TEAM_SLIPPY
} TitleTeam;

typedef struct {
    /* 0x00 */ s32 type;
    /* 0x04 */ s32 unk_04; // Always set to 0 and never used
    /* 0x08 */ void* texture;
    /* 0x0C */ u16* palette;
    /* 0x10 */ s32 width;
    /* 0x14 */ s32 height;
    /* 0x18 */ f32 xPos;
    /* 0x1C */ f32 yPos;
    /* 0x20 */ f32 xScale;
    /* 0x24 */ f32 yScale;
    /* 0x28 */ s32 red;
    /* 0x2C */ s32 green;
    /* 0x30 */ s32 blue;
    /* 0x34 */ s32 alpha;
} OptionCardTexture; // size = 0x38

typedef struct {
    /* 0x00 */ f32 x;
    /* 0x04 */ f32 y;
    /* 0x08 */ f32 z;
    /* 0x0C */ f32 xScale;
    /* 0x10 */ f32 yScale;
} OptionCardFrame; // size = 0x14

typedef struct {
    /* 0x0 */ f32 x;
    /* 0x4 */ f32 y;
    /* 0x8 */ f32 range;
} ArwingCursorPos; // size = 0xC

typedef struct {
    /* 0x00 */ OptionCardTexture tex;
    /* 0x38 */ OptionCardFrame frame;
    /* 0x4C */ ArwingCursorPos pos;
    /* 0x58 */ bool drawTex;
    /* 0x5C */ bool drawFrame;
} OptionEntry; // size = 0x60

typedef struct {
    s32 unk_0;
    s32 unk_4;
} StickInputOption;

typedef struct TitleArwingInfo {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ f32 scale;
    /* 0x10 */ f32 vel; // Assumption
    /* 0x14 */ char pad14[0x4];
    /* 0x18 */ f32 xRot;
    /* 0x1C */ f32 yRot;
    /* 0x20 */ f32 zRot;
    /* 0x24 */ f32 cockpitGlassXrot;
    /* 0x28 */ f32 laserGunsYpos;
    /* 0x2C */ f32 teamFaceXrot;
    /* 0x30 */ f32 teamFaceYrot;
    /* 0x34 */ s32 drawFace;
    /* 0x38 */ s32 timer;  // Used for closing the cockpit glass and take off
    /* 0x3C */ s32 unk_3C; // Related to engine glow. Investigate
    /* 0x40 */ s32 unk_40; // Related to engine glow. Investigate
    /* 0x44 */ f32 unk_44; // Related to engine glow. Investigate
    /* 0x48 */ bool drawShadow;
    /* 0x4C */ bool draw;
    /* 0x50 */ f32 sfxSource[3];
} TitleArwingInfo; // size = 0x5C

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ bool draw;
    /* 0x10 */ f32 scale;
} TitleCorneria; // size = 0x14

typedef struct AssetInfo {
    /* 0x00 */ void* unk_00;
    /* 0x04 */ void* unk_04;
    /* 0x08 */ s16 unk_08;
    /* 0x0C */ u32 unk_0C;
    /* 0x10 */ u32 unk_10;
    /* 0x14 */ f32 unk_14;
    /* 0x18 */ Vec3f unk_18;
    /* 0x24 */ Vec3f unk_24;
    /* 0x30 */ Vec3f unk_30;
    /* 0x3C */ Vec3f unk_3C;
    /* 0x48 */ Vec3f unk_48;
    /* 0x54 */ Vec3f unk_54;
    /* 0x60 */ Color_RGBA32 fog;
    /* 0x64 */ s16 fogNear;
    /* 0x66 */ s16 fogFar;
    /* 0x68 */ Color_RGBA32 env;
    /* 0x6C */ Color_RGBA32 prim;
    /* 0x70 */ u8 unk_70;
    /* 0x71 */ u8 unk_71;
} AssetInfo; // size = 0x72

extern u8 sPlayersVisible[];
extern f32 sMaTrainSpeedTarget;
extern f32 gTestVarF;
extern s32 D_menu_801B91A0;
extern Vec3f D_menu_801AF100[];
extern Vec3f D_menu_801AF118[];
extern Gfx D_menu_801AEF30[];
extern Vec3f D_ending_801985F0;
extern Gfx aEndVenomDL[];
extern u16 aAwCockpitGlassClouldReflextionTex[];
extern s32 D_ending_80196D04;
extern s32 D_ending_80196D00;
extern u32 D_ending_80196F8C;
extern u32 D_ending_80192E70;
extern Limb* aFoxSkel[23];
extern Limb* aFalcoSkel[23];
extern Limb* aPeppySkel[23];
extern Limb* aSlippySkel[21];
extern u16 aEndFloorTex[];
extern Gfx aEndFloorDL[];
extern f32 sCsWarpZoneTeamSetupOrient[4];
extern Vec3f sCsWarpZoneTeamSetupPos[4];
extern StickInputOption D_menu_801B9180;
extern StickInputOption D_menu_801B9190;
extern StickInputOption D_menu_801B9198;
extern u8 aMainGameCardTex[];
extern bool sExpertModesEnabled;
extern u8 aSoundCardTex[];
extern u8 aExpertCardTex[];
